import os
import pandas as pd
import numpy as np
import xlrd
import xlwt

filtertool = [".xlsx", "xls"]
rootdir = r'C:\Users\sxtyt\Desktop\filemanipulate\data'
list = os.listdir(rootdir) #列出文件夹下所有的目录与文件
result=[]
keyan_1  = ["涵洞","框构及旅客地道","铁路大桥","铁路中桥","铁路特大桥"]
chushe_1 = ["涵洞","框构及旅客地道","跨线公路桥","铁路中桥","铁路大桥","铁路特大桥"]
shigongtu_1 = ["新建涵洞","既有接长涵洞","特殊涵洞","旅客地道","单孔框构","多孔框构","渡槽","框构机排","跨线公路桥","铁路中桥","铁路小桥",
               "铁路大桥","铁路特大桥","补勘","补勘(连续)","补勘（连续）"]
for i in range(0,len(list)):
    path = os.path.join(rootdir,list[i])
    ext = os.path.splitext(path)[1]
    if ext in filtertool:
        name = os.path.basename(path)
        print("正在计算",name,"同事的工作量")
        S = 0
        df = pd.read_excel(path, index_cod = None, head = 0)
        for index, row in df.iterrows() :
            if row["设计项目类别"] == 1:
                if row["设计流程"] == 1:
                    if row["项目"] == "涵洞":
                        if row["设计阶段"] == 'A':
                            S = S + (0.5 + row["数量"] / 50) * row["站内或山区"] * row["接长或顶进"] * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + (0.5 + row["数量"] / 50) * row["站内或山区"] * row["接长或顶进"] * 0.2 * row["工作完成度"]
                        else:
                            S = S + (0.5 + row["数量"] / 50) * row["站内或山区"] * row["接长或顶进"] * 0.1 * row["工作完成度"]
                    elif row["项目"] == "框构及旅客地道":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + row["数量"] * 0.15 * row["工作完成度"]
                            else:
                                S = S + (0.5 + row["数量"] * 0.1) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + row["数量"] * 0.15 * 0.2 * row["工作完成度"]
                            else:
                                S = S + (0.5 + row["数量"] * 0.1) * 0.2 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + row["数量"] * 0.15 * 0.2 * row["工作完成度"]
                            else:
                                S = S + (0.5 + row["数量"] * 0.1) * 0.2 * row["工作完成度"]
                    elif row["项目"] == "跨线公路桥" or row["项目"] == "铁路大、中桥":
                        if row["设计阶段"] == 'A':
                             S = S + 0.5 + 0.2 * row["数量"] * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                             S = S + (0.5 + 0.2 * row["数量"]) * 0.2 * row["工作完成度"]
                        else:
                             S = S + (0.5 + 0.2 * row["数量"]) * 0.1 * row["工作完成度"]
                    elif row["项目"] == "铁路特大桥" :
                        if row["设计阶段"] == 'A':
                            if row["桥长"] <= 1000:
                                S = S + 2 + 0.1 * (row["桥长"]-500)/100 * row["工作完成度"]
                            elif 1000 < row["桥长"] <= 3000:
                                S = S + (2 + 0.1 * (row["桥长"]-500)/100)*0.8 * row["工作完成度"]
                            elif 3000 < row["桥长"] <= 10000:
                                S = S + (2 + 0.1 * (row["桥长"]-500)/100)*0.6 * row["工作完成度"]
                            elif row["桥长"] > 10000:
                                S = S + (2 + 0.1 * (row["桥长"]-500)/100)*0.4 * row["工作完成度"]
                            else:
                                print(name,"中第", index + 1 , "行的铁路特大桥项目输入错误，请按格式输入。")
                        elif row["设计阶段"] == 'B':
                            if row["跨度"] <= 1000:
                                S = S + ( 2 + 0.1 * (row["跨度"]-500)/100 ) * 0.2 * row["工作完成度"]
                            elif 1000 < row["跨度"] <= 3000:
                                S = S + (2 + 0.1 * (row["跨度"]-500)/100)*0.8 * 0.2 * row["工作完成度"]
                            elif 3000 < row["跨度"] <= 10000:
                                S = S + (2 + 0.1 * (row["跨度"]-500)/100)*0.6 * 0.2 * row["工作完成度"]
                            elif row["跨度"] > 10000:
                                S = S + (2 + 0.1 * (row["跨度"]-500)/100)*0.4 * 0.2 * row["工作完成度"]
                            else:
                                print(name,"中第", index + 1 , "行的铁路特大桥项目输入错误，请按格式输入。")
                        else:
                            if row["跨度"] <= 1000:
                                S = S + ( 2 + 0.1 * (row["跨度"]-500)/100 ) * 0.1 * row["工作完成度"]
                            elif 1000 < row["跨度"] <= 3000:
                                S = S + (2 + 0.1 * (row["跨度"]-500)/100)*0.8 * 0.1 * row["工作完成度"]
                            elif 3000 < row["跨度"] <= 10000:
                                S = S + (2 + 0.1 * (row["跨度"]-500)/100)*0.6 * 0.1 * row["工作完成度"]
                            elif row["跨度"] > 10000:
                                S = S + (2 + 0.1 * (row["跨度"]-500)/100)*0.4 * 0.1 * row["工作完成度"]
                            else:
                                print(name,"中第", index + 1 , "行的铁路特大桥项目输入错误，请按格式输入。")
                    else:
                        print( name,"表格第",index + 1, "行填写有误，请检查")
                elif row["设计流程"] == 2:
                    if row["项目"] == "涵洞":
                        if row["设计阶段"] == 'A':
                            S = S + (0.5 + row["数量"] / 30) * row["站内或山区"] * row["接长或顶进"] * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + (0.5 + row["数量"] / 30) * row["站内或山区"] * row["接长或顶进"] * 0.25 * row["工作完成度"]
                        else:
                            S = S + (0.5 + row["数量"] / 30) * row["站内或山区"] * row["接长或顶进"] * 0.12 * row["工作完成度"]
                    elif row["项目"] == "框构及旅客地道":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + (0.5 + row["数量"] * 0.15 + 2) * row["工作完成度"]
                            else:
                                S = S + (0.5 + row["数量"] * 0.15) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + (0.5 + row["数量"] * 0.15 + 2) * 0.25 * row["工作完成度"]
                            else:
                                S = S + (0.5 + row["数量"] * 0.15 ) * 0.25 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + (0.5 + row["数量"] * 0.15 + 2) * 0.12 * row["工作完成度"]
                            else:
                                S = S + (0.5 + row["数量"] * 0.15 ) * 0.12 * row["工作完成度"]
                    elif row["项目"] == "跨线公路桥" : #or row["项目"] == "铁路大桥" or row["项目"] == "铁路中桥":
                        if row["设计阶段"] == 'A':
                             S = S + (1 + 0.2 * row["数量"]) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                             S = S + (1 + 0.2 * row["数量"]) * 0.25 * row["工作完成度"]
                        else:
                             S = S + (0.5 + 0.2 * row["数量"]) * 0.12 * row["工作完成度"]
                    elif row["项目"] == "铁路中桥":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 1.5 * 0.8 * row["站内或山区"] * row["工作完成度"]
                            else:
                                S = S + 1.5 * row["站内或山区"] * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 1.5 * 0.8 * 0.25 * row["站内或山区"] * row["工作完成度"]
                            else:
                                S = S + 1.5 * 0.25 * row["站内或山区"] * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 1.5 * 0.8 * 0.12 * row["站内或山区"] * row["工作完成度"]
                            else:
                                S = S + 1.5 * 0.12 * row["站内或山区"] * row["工作完成度"]
                    elif row["项目"] == "铁路大桥":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 2.5 * 0.8 * row["站内或山区"] * row["工作完成度"]
                            else:
                                S = S + 2.5 * row["站内或山区"] * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 2.5 * 0.8 * 0.25 * row["站内或山区"] * row["工作完成度"]
                            else:
                                S = S + 2.5 * 0.25 * row["站内或山区"] * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 2.5 * 0.8 * 0.12 * row["站内或山区"] * row["工作完成度"]
                            else:
                                S = S + 2.5 * 0.12 * row["站内或山区"] * row["工作完成度"]
                    elif row["项目"] == "铁路特大桥" :
                        if row["设计阶段"] == 'A':
                            if row["桥长"] <= 1000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100) * row["工作完成度"]
                            elif 1000 < row["桥长"] <= 3000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.9 * row["工作完成度"]
                            elif 3000 < row["桥长"] <= 10000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.7 * row["工作完成度"]
                            elif row["桥长"] > 10000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.6 * row["工作完成度"]
                            else:
                                print(name,"中第", index + 1 , "行的铁路特大桥项目输入错误，请按格式输入。")
                        elif row["设计阶段"] == 'B':
                            if row["跨度"] <= 1000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100) * row["工作完成度"]
                            elif 1000 < row["跨度"] <= 3000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.9*0.25 * row["工作完成度"]
                            elif 3000 < row["跨度"] <= 10000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.7*0.25 * row["工作完成度"]
                            elif row["跨度"] > 10000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.6*0.25 * row["工作完成度"]
                            else:
                                print(name,"中第", index + 1 , "行的铁路特大桥项目输入错误，请按格式输入。")
                        else:
                            if row["跨度"] <= 1000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100) * row["工作完成度"]
                            elif 1000 < row["跨度"] <= 3000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.9*0.12 * row["工作完成度"]
                            elif 3000 < row["跨度"] <= 10000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.7*0.12 * row["工作完成度"]
                            elif row["跨度"] > 10000:
                                S = S + (2.5 + 0.15 * (row["跨度"]-500)/100)*0.6*0.12 * row["工作完成度"]
                            else:
                                print(name,"中第", index + 1 , "行的铁路特大桥项目输入错误，请按格式输入。")
                    else:
                        print( name,"表格第",index + 1, "行填写有误，请检查")
                elif row["设计流程"] == 3:
                    if row["项目"] == "新建涵洞":
                        if row["设计阶段"] == 'A':
                            if row["站内或山区"] == 1:
                                S = S +  row["数量"] * 0.4 * row["工作完成度"]
                            else :
                                S = S + (0.5 + row["数量"] * 0.2) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["站内或山区"] == 1:
                                S = S + row["数量"] * 0.4 * 0.35 * row["工作完成度"]
                            else :
                                S = S + (0.5 + row["数量"] * 0.2) * 0.35 * row["工作完成度"]
                        else:
                            if row["站内或山区"] == 1:
                                S = S + row["数量"] * 0.4 * 0.15 * row["工作完成度"]
                            else :
                                S = S + (0.5 + row["数量"] * 0.2) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "既有接长涵洞":
                        if row["设计阶段"] == 'A':
                            S = S + (0.5 + row["数量"] * 0.5) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + (0.5 + row["数量"] * 0.5) * 0.35 * row["工作完成度"]
                        else:
                            S = S + (0.5 + row["数量"] * 0.5) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "特殊涵洞":
                        if row["设计阶段"] == 'A':
                            S = S + 1.5 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + 1.5 * 0.35 * row["工作完成度"]
                        else:
                            S = S + 1.5 * 0.15 * row["工作完成度"]
                    elif row["项目"] == "旅客地道":
                        if row["设计阶段"] == 'A':
                            S = S + (2 + 1 * n) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + (2 + 1 * n) * 0.35 * row["工作完成度"]
                        else:
                            S = S + (2 + 1 * n) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "单孔框构":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1 :
                                S = S + (1.5 + row["接长或顶进"] + 2) * row["工作完成度"]
                            else:
                                S = S + (1.5 + row["接长或顶进"]) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1 :
                                S = S + (1.5 + row["接长或顶进"] + 2) * 0.35 * row["工作完成度"]
                            else:
                                S = S + (1.5 + row["接长或顶进"]) * 0.35 * row["工作完成度"]
                        else:
                            if row["说明"] == 1 :
                                S = S + (1.5 + row["接长或顶进"] + 2) * 0.15 * row["工作完成度"]
                            else:
                                S = S + (1.5 + row["接长或顶进"]) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "多孔框构":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1 :
                                S = S + (2.5 + row["接长或顶进"] + 2) * row["工作完成度"]
                            else:
                                S = S + (2.5 + row["接长或顶进"]) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1 :
                                S = S + (2.5 + row["接长或顶进"] + 2) * 0.35 * row["工作完成度"]
                            else:
                                S = S + (2.5 + row["接长或顶进"]) * 0.35 * row["工作完成度"]
                        else:
                            if row["说明"] == 1 :
                                S = S + (2.5 + row["接长或顶进"] + 2) * 0.15 * row["工作完成度"]
                            else:
                                S = S + (2.5 + row["接长或顶进"]) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "渡槽":
                        if row["设计阶段"] == 'A':
                            S = S + 5 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + 5 * 0.35 * row["工作完成度"]
                        else:
                            S = S + 5 * 0.15 * row["工作完成度"]
                    elif row["项目"] == "框构机排":
                        tem = input("请输入常规设计项目，施工图设计阶段", name, "的框构机排的调整系数:")
                        if row["设计阶段"] == 'A':
                            S = S + float(tem) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + float(tem) * 0.35 * row["工作完成度"]
                        else:
                            S = S + float(tem) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "跨线公路桥":
                        if row["设计阶段"] == 'A':
                            S = S + 8 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + 8 * 0.4 * row["工作完成度"]
                        else:
                            S = S + 8 * 0.18 * row["工作完成度"]
                    elif row["项目"] == "铁路中、小桥" : #or row["项目"] == "铁路大桥" or row["项目"] == "铁路中桥":
                        if row["设计阶段"] == 'A':
                             S = S + (2 + 0.1 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                             S = S + (2 + 0.1 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * 0.4 * row["工作完成度"]
                        else:
                             S = S + (2 + 0.1 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * 0.18 * row["工作完成度"]
                    elif row["项目"] == "铁路大桥" :
                        if row["设计阶段"] == 'A':
                             S = S + (2.5 + 0.1 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                             S = S + (2.5 + 0.1 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * 0.4 * row["工作完成度"]
                        else:
                             S = S + (2.5 + 0.1 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * 0.18 * row["工作完成度"]
                    elif row["项目"] == "铁路特大桥":
                        if row["设计阶段"] == 'A':
                             S = S + (3.5 + 0.05 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                             S = S + (3.5 + 0.05 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * 0.4 * row["工作完成度"]
                        else:
                             S = S + (3.5 + 0.05 * row["数量"] + 0.5 * row["水文"] + 0.2 * row["曲线"] + 0.3 * row["地震液化层"] + 0.3 * row["桥梁联数"]
                                 + 0.5 * row["基础类型"] + 0.5 * row["基坑防护图"] + 0.5 * row["刷坡防护工作"] + 0.02 * row["墩横断面图"] +
                                 0.2 * row["岩溶展布图"]) * 0.18 * row["工作完成度"]
                    elif row["项目"] == "补勘":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 0.15 * row["工作完成度"]
                            elif row["说明"] == 2:
                                S = S + 0.4 * row["工作完成度"]
                            elif row["说明"] == 3:
                                S = S + 0.35 * row["工作完成度"]
                            else:
                                S = S + 0.25 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 0.15 * 0.35 * row["工作完成度"]
                            elif row["说明"] == 2:
                                S = S + 0.4 * 0.35 * row["工作完成度"]
                            elif row["说明"] == 3:
                                S = S + 0.35 * 0.35 * row["工作完成度"]
                            else:
                                S = S + 0.25 * 0.35 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 0.15 * 0.15 * row["工作完成度"]
                            elif row["说明"] == 2:
                                S = S + 0.4 * 0.15 * row["工作完成度"]
                            elif row["说明"] == 3:
                                S = S + 0.35 * 0.15 * row["工作完成度"]
                            else:
                                S = S + 0.25 * 0.15 * row["工作完成度"]
                    elif row["项目"] == "补勘(连续)" or row["项目"] == "补勘（连续）":
                        if n["数量"] < 5:
                            print(name,"常规设计项目中施工图的补勘（连续），由于墩数小于5个，未参与计算。")
                        else:
                            if row["设计阶段"] == 'A':
                                if row["说明"] == 2:
                                    S = S + (0.3 + (0.05+0.35) * n )* row["工作完成度"]
                                elif row["说明"] == 3:
                                    S = S + (0.3 + (0.05+0.3) * n )* row["工作完成度"]
                                else:
                                    S = S + (0.3 + 0.05 * n) * row["工作完成度"]
                            elif row["设计阶段"] == 'B':
                                if row["说明"] == 2:
                                    S = S + (0.3 + (0.05+0.35) * n)  * 0.35 * row["工作完成度"]
                                elif row["说明"] == 3:
                                    S = S + (0.3 + (0.05+0.3) * n) * 0.35 * row["工作完成度"]
                                else:
                                    S = S + (0.3 + 0.05 * n) * 0.35 * row["工作完成度"]
                            else:
                                if row["说明"] == 2:
                                    S = S + (0.3 + (0.05+0.35) * n)  * 0.15 * row["工作完成度"]
                                elif row["说明"] == 3:
                                    S = S + (0.3 + (0.05+0.3) * n) * 0.15 * row["工作完成度"]
                                else:
                                    S = S + (0.3 + 0.05 * n) * 0.15 * row["工作完成度"]
                    else:
                        print( name,"表格第",index + 1, "行填写有误，请检查")
                else:
                    print( name,"表格第",index + 1, "行填写有误，请检查")
            elif row["设计项目类别"] == 2:
                if row["项目"] == "实体桥墩设计":
                    if row["设计阶段"] == 'A':
                        if row["说明"] >= 30:
                            S = S + 2 * row["工作完成度"]
                        else:
                            tem = input("请输入综合单项工作在实体桥墩设计时的折减系数（0.3—0.8）:")
                            S = S + 2 * float(tem) * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        if row["说明"] >= 30:
                            S = S + 2 * 0.4 * row["工作完成度"]
                        else:
                            tem = input("请输入综合单项工作实体桥墩设计时的折减系数（0.3—0.8）:")
                            S = S + 2 * float(tem) * 0.4 * row["工作完成度"]
                    else:
                        if row["说明"] >= 30:
                            S = S + 2 * 0.15 * row["工作完成度"]
                        else:
                            tem = input("请输入综合单项工作实体桥墩设计时的折减系数（0.3—0.8）:")
                            S = S + 2 * float(tem) * 0.15 * row["工作完成度"]
                elif row["项目"] == "钢筋混凝土桥墩设计":
                    if row["设计阶段"] == 'A':
                        if row["说明"] <= 30:
                            S = S + 5 * row["工作完成度"]
                        else:
                            tem = input("请输入综合单项工作钢筋混凝土桥墩设计时的折减系数（0.5—0.8）:")
                            S = S + 5 * float(tem) * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        if row["说明"] <= 30:
                            S = S + 5 * 0.4 * row["工作完成度"]
                        else:
                            tem = input("请输入综合单项工作钢筋混凝土桥墩设计时的折减系数（0.5—0.8）:")
                            S = S + 5 * float(tem) * 0.4 * row["工作完成度"]
                    else:
                        if row["说明"] <= 30:
                            S = S + 5 * 0.15 * row["工作完成度"]
                        else:
                            tem = input("请输入综合单项工作钢筋混凝土桥墩设计时的折减系数（0.5—0.8）:")
                            S = S + 5 * float(tem) * 0.15 * row["工作完成度"]
                elif row["项目"] == "不等跨顶帽设计":
                    if row["设计阶段"] == 'A':
                        S = S + 0.5 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 0.5 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 0.5 * 0.15
                elif row["项目"] == "桥台设计":
                    tem = input("请根据可利用成果情况，输入综合单项工作桥台设计时的折减系数（0.3-0.8）:")
                    if row["设计阶段"] == 'A':
                        S = S + 4 * float(tem) * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 4 * float(tem) * 0.4 * row["工作完成度"] * row["工作完成度"]
                    else:
                        S = S + 4 * float(tem) * 0.15 * row["工作完成度"]
                elif row["项目"] == "椎体挡墙设计":
                    if row["设计阶段"] == 'A':
                        S = S + 1 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 1 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 1 * 0.15 * row["工作完成度"]
                elif row["项目"] == "结构图":
                    tem = input("请根据复杂程度，输入在综合单项中结构图的调整系数（0.6-0.8）:")
                    if row["设计阶段"] == 'A':
                        S = S + float(tem) * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + float(tem) * 0.4 * row["工作完成度"]
                    else:
                        S = S + float(tem) * 0.15 * row["工作完成度"]
                elif row["项目"] == "钢筋图":
                    if row["设计阶段"] == 'A':
                        S = S + 1 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 1 * 0.3 * row["工作完成度"]
                    else:
                        S = S + 1 * 0.12 * row["工作完成度"]
                elif row["项目"] == "预应力混凝土简支梁计算分析":
                    if row["设计阶段"] == 'A':
                        S = S + 8 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 8 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 8 * 0.15 * row["工作完成度"]
                elif row["项目"] == "预应力连续梁计算":
                    if row["设计阶段"] == 'A':
                        if row["跨度"] > 80 or row["半径"] <= 800:
                            S = S + 19 * row["工作完成度"]
                        elif row["跨度"] > 80 and row["半径"] <= 800:
                            S = S + 22 * row["工作完成度"]
                        else:
                            S = S + 16 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        if row["跨度"] > 80 or row["半径"] <= 800:
                            S = S + 19 * 0.4 * row["工作完成度"]
                        elif row["跨度"] > 80 and row["半径"] <= 800:
                            S = S + 22 * 0.4 * row["工作完成度"]
                        else:
                            S = S + 16 * 0.4 * row["工作完成度"]
                    else:
                        if row["跨度"] > 80 or row["半径"] <= 800:
                            S = S + 19 * 0.15 * row["工作完成度"]
                        elif row["跨度"] > 80 and row["半径"] <= 800:
                            S = S + 22 * 0.15 * row["工作完成度"]
                        else:
                            S = S + 16 * 0.15 * row["工作完成度"]
                elif row["项目"] == "预应力刚构连续梁计算分析":
                    if row["设计阶段"] == 'A':
                        if row["跨度"] > 80 or row["半径"] <= 800:
                            S = S + 23 * row["工作完成度"]
                        elif row["跨度"] > 80 and row["半径"] <= 800:
                            S = S + 26 * row["工作完成度"]
                        else:
                            S = S + 20 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        if row["跨度"] > 80 or row["半径"] <= 800:
                            S = S + 23 * 0.4 * row["工作完成度"]
                        elif row["跨度"] > 80 and row["半径"] <= 800:
                            S = S + 26 * 0.4 * row["工作完成度"]
                        else:
                            S = S + 20 * 0.4 * row["工作完成度"]
                    else:
                        if row["跨度"] > 80 or row["半径"] <= 800:
                            S = S + 23 * 0.15 * row["工作完成度"]
                        elif row["跨度"] > 80 and row["半径"] <= 800:
                            S = S + 26 * 0.15 * row["工作完成度"]
                        else:
                            S = S + 20 * 0.15 * row["工作完成度"]
                elif row["项目"] == "框架墩计算":
                    if row["设计阶段"] == 'A':
                        if row["说明"] == 1:
                            S = S + 10 * row["工作完成度"]
                        else:
                            S = S + 8 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        if row["说明"] == 1:
                            S = S + 10 * 0.4 * row["工作完成度"]
                        else:
                            S = S + 8 * 0.4 * row["工作完成度"]
                    else:
                        if row["说明"] == 1:
                            S = S + 10 * 0.15 * row["工作完成度"]
                        else:
                            S = S + 8 * 0.15 * row["工作完成度"]
                elif row["项目"] == "钢筋混凝土刚架结构及连续刚构板梁":
                    if row["设计阶段"] == 'A':
                        S = S + 10 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 10 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 10 * 0.15 * row["工作完成度"]
                elif row["项目"] == "钢筋混凝土简支板梁" :
                    if row["设计阶段"] == 'A':
                        S = S + 2 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 2 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 2 * 0.15 * row["工作完成度"]
                elif row["项目"] == "一般拱桥主结构计算分析" :
                    if row["设计阶段"] == 'A':
                        if row["说明"] == 1:
                            S = S + 31 * row["工作完成度"]
                        else:
                            S = S + 26 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        if row["说明"] == 1:
                            S = S + 31 * 0.4 * row["工作完成度"]
                        else:
                            S = S + 26 * 0.4 * row["工作完成度"]
                    else:
                        if row["说明"] == 1:
                            S = S + 31 * 0.15 * row["工作完成度"]
                        else:
                            S = S + 26 * 0.15 * row["工作完成度"]
                elif row["项目"] == "斜拉桥主结构计算分析":
                    if row["设计阶段"] == 'A':
                        S = S + 160 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 160 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 160 * 0.15 * row["工作完成度"]
                elif row["项目"] == "局部结构应力分析":
                    if row["设计阶段"] == 'A':
                        S = S + 3.5 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 3.5 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 3.5 * 0.15 * row["工作完成度"]
                elif row["项目"] == "转体计算":
                    if row["设计阶段"] == 'A':
                        S = S + 4.5 * row["工作完成度"]
                    elif row["设计阶段"] == 'B':
                        S = S + 4.5 * 0.4 * row["工作完成度"]
                    else:
                        S = S + 4.5 * 0.15 * row["工作完成度"]
                else:
                    print( name,"表格第",index + 1, "行填写有误，请检查")
            elif row["设计项目类别"] == 3:
                if row["设计流程"] == 4:
                    if row["项目"] == "明挖涵洞":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 3.5 * row["工作完成度"]
                            else:
                                S = S + 2 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 3.5 * 0.2 * row["工作完成度"]
                            else:
                                S = S + 2 * 0.2 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 3.5 * 0.1 * row["工作完成度"]
                            else:
                                S = S + 2 * 0.1 * row["工作完成度"]
                    elif row["项目"] == "顶进涵洞":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 14 * row["工作完成度"]
                            else:
                                S = S + 8 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 14 * 0.2 * row["工作完成度"]
                            else:
                                S = S + 8 * 0.2 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 14 * 0.1 * row["工作完成度"]
                            else:
                                S = S + 8 * 0.1 * row["工作完成度"]
                    elif row["项目"] == "明挖框构" :
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 6 * row["工作完成度"]
                            else:
                                S = S + 4 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 6 * 0.2 * row["工作完成度"]
                            else:
                                S = S + 4 * 0.2 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 6 * 0.1 * row["工作完成度"]
                            else:
                                S = S + 4 * 0.1 * row["工作完成度"]
                    elif row["项目"] == "顶进框构":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 18 * row["工作完成度"]
                            else:
                                S = S + 10 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 18 * 0.2 * row["工作完成度"]
                            else:
                                S = S + 10 * 0.2 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 18 * 0.1 * row["工作完成度"]
                            else:
                                S = S + 10 * 0.1 * row["工作完成度"]
                    elif row["项目"] == "封闭式路堑":
                        tem = input("请输入",name,"在外委项目工作时封闭式路堑的调整系数（5-7）:")
                        if row["设计阶段"] == 'A':
                            S = S + float(tem) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + float(tem)*0.2 * row["工作完成度"]
                        else:
                            S = S + float(tem)*0.1 * row["工作完成度"]
                elif row["设计流程"] == 3:
                    if row["项目"] == "明挖涵洞":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 3.5 * row["工作完成度"]
                            else:
                                S = S + 2 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 3.5 * 0.35 * row["工作完成度"]
                            else:
                                S = S + 2 * 0.35 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 3.5 * 0.1 * row["工作完成度"]
                            else:
                                S = S + 2 * 0.1 * row["工作完成度"]
                    elif row["项目"] == "顶进涵洞":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 11 * row["工作完成度"]
                            else:
                                S = S + 8 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 11 * 0.35 * row["工作完成度"]
                            else:
                                S = S + 8 * 0.35 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 11 * 0.12 * row["工作完成度"]
                            else:
                                S = S + 8 * 0.12 * row["工作完成度"]
                    elif row["项目"] == "明挖框构":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1 or row["说明"] == 2 :
                                S = S + 6 * row["工作完成度"]
                            elif row["说明"] == 3 :
                                S = S + 8 * row["工作完成度"]
                            else:
                                S = S + 4 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1 or row["说明"] == 2 :
                                S = S + 6 * 0.35 * row["工作完成度"]
                            elif row["说明"] == 3 :
                                S = S + 8 * 0.35 * row["工作完成度"]
                            else:
                                S = S + 4 * 0.35 * row["工作完成度"]
                        else:
                            if row["说明"] == 1 or row["说明"] == 2 :
                                S = S + 6 * 0.12 * row["工作完成度"]
                            elif row["说明"] == 3 :
                                S = S + 8 * 0.12 * row["工作完成度"]
                            else:
                                S = S + 4 * 0.12 * row["工作完成度"]
                    elif row["项目"] == "顶进框构":
                        if row["设计阶段"] == 'A':
                            if row["说明"] == 1:
                                S = S + 14 * row["工作完成度"]
                            else:
                                S = S + 10 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            if row["说明"] == 1:
                                S = S + 14 * 0.35 * row["工作完成度"]
                            else:
                                S = S + 10 * 0.35 * row["工作完成度"]
                        else:
                            if row["说明"] == 1:
                                S = S + 14 * 0.12 * row["工作完成度"]
                            else:
                                S = S + 10 * 0.12 * row["工作完成度"]
                    elif row["项目"] == "封闭式路堑":
                        if row["设计阶段"] == 'A':
                            S = S + 10 * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + 10 * 0.35 * row["工作完成度"]
                        else:
                            S = S + 10 * 0.15 * row["工作完成度"]
                    elif row["项目"] == "安全评估":
                        tem = input("请输入",name,"在外委项目工作时安全评估的调整系数（5-9）（二维5天，三维9天）:")
                        if row["设计阶段"] == 'A':
                            S = S + float(tem) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + float(tem) * 0.35 * row["工作完成度"]
                        else:
                            S = S + float(tem) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "施工监测方案":
                        tem = input("请输入",name,"在外委项目工作时施工监测方案的调整系数（3-5）:")
                        if row["设计阶段"] == 'A':
                            S = S + float(tem) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + float(tem) * 0.35 * row["工作完成度"]
                        else:
                            S = S + float(tem) * 0.15 * row["工作完成度"]
                    elif row["项目"] == "上跨公路桥" or row["项目"] == "人行天桥":
                        tem = input("请输入",name,"在外委项目工作时上跨公路桥的调整系数（不含特设梁）（10-12）:")
                        if row["设计阶段"] == 'A':
                            S = S + float(tem) * row["工作完成度"]
                        elif row["设计阶段"] == 'B':
                            S = S + float(tem) * 0.35 * row["工作完成度"]
                        else:
                            S = S + float(tem) * 0.15 * row["工作完成度"]
                    else:
                        print( name,"表格第",index + 1, "行填写有误，请检查")
            elif row["设计项目类别"] == 4:
                S = S + row["数量"]
            else:
                print( name,"表格第",index + 1, "行填写有误，请检查")
        result.append([ name , S ])
        print(name, "同事的工作量已计算完毕！")
print("所有同事的工作量已计算完毕！")
output = pd.DataFrame(result)
output.to_excel("总价计算表.xlsx", header = None, index = None)
